export const TERM_OF_USE = `본 이용약관(이하 '약관')은 HealthyP(이하 '서비스')의 다양한 서비스의 이용과 관련하여 서비스와 이용자 간의 권리, 의무 및 책임사항, 이용조건 및 절차, 기타 필요한 사항을 규정함을 목적으로 합니다.

제 1조 (목적)
본 약관은 이용자가 서비스를 이용함에 있어 서비스와 이용자 간의 권리, 의무 및 책임사항을 명확히 하여 원활한 서비스 이용을 도모합니다.

제 2조 (정의)
"이용자"란 서비스에 접속하여 이 약관에 따라 서비스가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.

"회원"이라 함은 서비스에 개인정보를 제공하여 회원등록을 한 자로서, 서비스의 정보를 지속적으로 제공받으며, 서비스가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.

"비회원"이라 함은 회원에 가입하지 않고 서비스가 제공하는 서비스를 이용하는 자를 말합니다.


제 3조 (회원가입 및 정보수집)
회원가입 시 서비스는 이용자로부터 다음의 정보를 수집합니다:
이메일 주소
비밀번호
사용자가 설정하는 닉네임

서비스는 회원가입 과정에서 서비스 이용을 위해 필요한 최소한의 정보만을 수집합니다. 추가적인 정보 수집이 필요한 경우, 서비스는 이용자의 동의를 얻어야 합니다.

제 4조 (개인정보의 보호 및 사용)
서비스는 관련 법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보를 보호하기 위해 노력합니다.

회원의 개인정보보호에 관해서는 관련 법령 및 서비스가 정하는 "개인정보처리방침"에 정한 바에 의합니다.

서비스는 회원의 개인정보를 본인의 동의 없이 제3자에게 제공하지 않습니다. 단, 법령의 규정에 의거하거나, 수사 목적으로 국가기관으로부터 요구 받은 경우 등 법률에 특별한 규정이 있는 경우는 예외입니다.

`;

export const EMAIL_SERVICE = `제 1조 (목적)
본 약관은 HealthyP의 이메일 서비스 레터(이하 '뉴스레터') 구독과 관련하여 HealthyP(이하 '서비스 제공자')와 구독자(이하 '이용자') 간의 권리와 의무, 서비스 제공 조건 및 절차 등에 관한 사항을 규정함을 목적으로 합니다.

제 2조 (뉴스레터 서비스 내용)
뉴스레터 서비스는 이용자에게 서비스 제공자의 최신 소식, 정보, 이벤트, 프로모션 등을 이메일을 통해 주기적으로 전송하는 서비스입니다.

뉴스레터의 내용은 서비스 제공자의 재량에 따라 결정되며, 이용자에게 통지 없이 서비스 내용이 변경될 수 있습니다.


제 3조 (구독 및 동의)
이용자는 서비스 제공자의 뉴스레터 구독 시, 본 약관에 동의함으로써 뉴스레터 서비스를 신청할 수 있습니다.

이용자는 뉴스레터 구독 신청을 통해 서비스 제공자로부터 마케팅 자료, 정보, 이벤트 소식 등을 이메일로 받는 데 동의합니다.

뉴스레터 구독은 선택사항이며, 언제든지 구독 취소를 요청할 수 있습니다.


제 4조 (구독 취소)
이용자는 언제든지 뉴스레터 수신을 거부할 수 있으며, 이 경우 서비스 제공자는 즉시 뉴스레터 발송을 중단합니다.

구독 취소는 뉴스레터에 포함된 '구독 취소' 링크를 클릭하여 진행할 수 있습니다.


제 5조 (개인정보의 보호)
서비스 제공자는 뉴스레터 구독을 위해 수집한 이메일 주소를 해당 서비스의 목적 외에는 사용하지 않으며, 제3자에게 제공하지 않습니다.

이메일 주소 등 구독자의 개인정보 보호에 관한 사항은 서비스 제공자의 '개인정보처리방침'에 따릅니다.

`;

export const FIRST_MAIN = 'HealthyP 이용 약관 동의';

export const SECOND_MAIN = '이메일 서비스 레터 받기(선택)';
